# l = [i for i in range(1, 11) if i % 2 == 0]
# print(l)
# # автоматическое создание  цифрового списка четных чисел

# 1 0 1 0 1 0 1 0
# l = [ 1 if i % 2 else 0 for i in range(10)]
# print(l)

# генерация списка от большего к меньшему
# l = [i for i in range (10, 0, -1)]
# print(l)

# # вывод негласных букв из ввода используя 
# s = input("type smth")
# l = [i for i in s if i not in "aeoyuiAEOYUI"]
# print(l)

# # создать список из 10 "0"  и заменить по индексу елементы
# l = [0] * 10
# l[3] = 2
# l[4] = 2
# print(l)


# # Исполбщование среза для отрезания послежнего символа
# s = "fvf;nvd"
# print(s[:-1])

# # вставка внутрь строки фрагмента используя срез
# s = "fjdflsnd"
# s = s[:3] + "aa" + s[5:]
# print(s)


# tuple() - кортеж, неизменяемый список
# list[] - список - изменяемый


# # выводит кол-во елементов в каждлм елементе списка 
# c = [[1, 2, 3], [2] , [4, 5]]
# print(len(c[0]), len(c[1]), len(c[2]))

# # суммирование данных в каждом елементе списка
# c = [[1, 2, 3], [3], [4,5]]
# answer = []
# for i in c:
#     s = 0
#     for j in i:
#         s +=j
#     answer += [s]
# print(answer)


# список индекстов в которых есть "3"
c = [[1, 2, 3], [3], [4, 2]]
answer = []
for i, val in enumerate(c):
    if 3 in val:
        answer += [i]
print(answer)
